In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [25]:
data_path = pd.read_csv('./dataset/Credit card.csv', usecols=['City', 'Date', 'Card Type','Exp Type','Gender',	'Amount'])
data = pd.DataFrame(data_path)
data.head()

                    City       Date  Card Type Exp Type Gender  Amount
0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [24]:
data.columns

Index(['City', 'Date', 'Card Type', 'Exp Type', 'Gender', 'Amount'], dtype='object')

In [26]:
data.shape

(26052, 6)

In [27]:
data.dtypes

City         object
Date         object
Card Type    object
Exp Type     object
Gender       object
Amount        int64
dtype: object

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City       26052 non-null  object
 1   Date       26052 non-null  object
 2   Card Type  26052 non-null  object
 3   Exp Type   26052 non-null  object
 4   Gender     26052 non-null  object
 5   Amount     26052 non-null  int64
dtypes: int64(1), object(5)
memory usage: 1.2+ MB

In [30]:
data.isna().values.any()

False

In [31]:
data[data.duplicated()]

Empty DataFrame
Columns: [City, Date, Card Type, Exp Type, Gender, Amount]
Index: []

In [32]:
data.describe()

              Amount
count   26052.000000
mean   156411.537425
std    103063.254287
min      1005.000000
25%     77120.250000
50%    153106.500000
75%    228050.000000
max    998077.000000

In [34]:
data.head()

                    City       Date  Card Type Exp Type Gender  Amount
0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [35]:
data['Date'] = pd.to_datetime(data['Date'])
data[] = data['Date'].apply(lambda time: time.dayofweek)
data

                        City       Date  Card Type Exp Type Gender  Amount
0               Delhi, India 2014-10-29       Gold    Bills      F   82475
1      Greater Mumbai, India 2014-08-22   Platinum    Bills      F   32555
2           Bengaluru, India 2014-08-27     Silver    Bills      F  101738
3      Greater Mumbai, India 2014-04-12  Signature    Bills      F  123424
4           Bengaluru, India 2015-05-05       Gold    Bills      F  171574
...                      ...        ...        ...      ...    ...     ...
26047         Kolkata, India 2014-06-22     Silver   Travel      F  128191
26048            Pune, India 2014-08-03  Signature   Travel      M  246316
26049       Hyderabad, India 2015-01-16     Silver   Travel      M  265019
26050          Kanpur, India 2014-09-14     Silver   Travel      M   88174
26051       Hyderabad, India 2013-10-19  Signature    Bills      M  184410

[26052 rows x 6 columns]